Revit 2027 API
RoutingPreferenceManager.GetRule Method
 Gets the specified rule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RoutingPreferenceRule GetRule(
	RoutingPreferenceRuleGroupType groupType,
	int index
)
Public Function GetRule (
	groupType As RoutingPreferenceRuleGroupType,
	index As Integer
) As RoutingPreferenceRule
public:
RoutingPreferenceRule^ GetRule(
	RoutingPreferenceRuleGroupType groupType,
	int index
)
member GetRule :
        groupType : RoutingPreferenceRuleGroupType *
        index : int -> RoutingPreferenceRule
Parameters
groupType RoutingPreferenceRuleGroupType
 The routing preference group type from which the rule should be returned.
index Int32
 The zero-based index where the rule should be returned.
Return Value
RoutingPreferenceRule
 The rule at the specified group and zero-based index position.
Exceptions
Exception | Condition
ArgumentException |  index is not a valid zero-based index within groupType. -or- Thrown if the index is out of bounds
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
RoutingPreferenceManager Class
Autodesk.Revit.DB Namespace